In [7]:
# 创建数据库
import pymysql
 
# 打开数据库连接
db = pymysql.connect(host="localhost",user="root",password="Lxk815714",port=3306)
 
# 使用 cursor() 方法创建一个游标对象 cursor
cursor = db.cursor()
 
# 使用 execute()  方法执行 SQL 查询 
cursor.execute("SELECT VERSION()")
 
# 使用 fetchone() 方法获取单条数据.
data = cursor.fetchone()
# 创建数据库
cursor.execute('create database spiders')
print ("Database version : %s " % data)
 
# 关闭数据库连接
db.close()

Database version : 8.0.15

In [11]:
# 创建数据表

# 打开数据库连接
db = pymysql.connect(host="localhost",user="root",password="Lxk815714",port=3306,db='spiders')
 
# 使用 cursor() 方法创建一个游标对象 cursor
cursor = db.cursor()
 
# 使用 execute() 方法执行 SQL，如果表存在则删除
cursor.execute("drop table if exists students")
 
# 使用预处理语句创建表
sql = '''
create table students
(id varchar(255) primary key,
name varchar(255) not null,
age int not null)'''
 
cursor.execute(sql)
 
# 关闭数据库连接
db.close()

/Users/brianlee/anaconda3/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1051, "Unknown table 'spiders.students'")
  result = self._query(query)

In [12]:
# 数据库插入操作
# 打开数据库连接
s_id = '2012001'
user = 'Bob'
age = 20
db = pymysql.connect(host="localhost",user="root",password="Lxk815714",port=3306,db='spiders')
 
# 使用cursor()方法获取操作游标 
cursor = db.cursor()

# SQL 插入语句
sql = """insert into students 
values(%s,%s,%i)"""
try:
   # 执行sql语句
   cursor.execute(sql,(s_id,user,age))
   # 提交到数据库执行
   db.commit()
except:
   # 如果发生错误则回滚
   db.rollback()

db.close()

In [25]:
data = {'id':'2012002',
       'name':'Mary',
       'age':21}
table = 'students'
keys = ','.join(data.keys())
values = ','.join(['%s']*len(data))
sql = 'insert into {table} ({keys}) values ({values})'.format(table = table,keys = keys,values = values)
db = pymysql.connect(host="localhost",user="root",password="Lxk815714",port=3306,db='spiders')
 
# 使用cursor()方法获取操作游标 
cursor = db.cursor()
try:
    if cursor.execute(sql,tuple(data.values())):
        print('succeeded')
        db.commit()
except:
    print('Failed')
    db.rollback()
db.close()

succeeded

Python查询Mysql使用 fetchone() 方法获取单条数据, 使用fetchall() 方法获取多条数据。

fetchone(): 该方法获取下一个查询结果集。结果集是一个对象
fetchall(): 接收全部的返回结果行.
rowcount: 这是一个只读属性，并返回执行execute()方法后影响的行数。

In [27]:
# 数据库查询
sql = 'select * from students where age>20'
db = pymysql.connect(host='localhost',user='root',password='Lxk815714',port=3306,db='spiders')
cursor = db.cursor()

try:
    cursor.execute(sql)
    print('rowcounts:',cursor.rowcount)
    results = cursor.fetchall()
    print('resultstype;',type(results))
    print('results;',results)
    for row in results:
        print(row)
except:
    print('Error')

rowcounts: 1
resultstype; <class 'tuple'>
results; (('2012002', 'Mary', 21),)
('2012002', 'Mary', 21)

In [28]:
try:
    cursor.execute(sql)
    row = cursor.fetchone()
    while row:
        print('row:',row)
        row = cursor.fetchone()
except:
    print('Error')

row: ('2012002', 'Mary', 21)

In [29]:
# 数据库更新操作
# 打开数据库连接
db = pymysql.connect(host='localhost',user='root',password='Lxk815714',port=3306,db='spiders')
 
# 使用cursor()方法获取操作游标 
cursor = db.cursor()
 
# SQL 更新语句
sql = 'update students set age=%s where name=%s'
try:
   # 执行SQL语句
   cursor.execute(sql,(25,Bob))
   # 提交到数据库执行
   db.commit()
except:
   # 发生错误时回滚
   db.rollback()

# 关闭数据库连接
db.close()

In [36]:
data = {'id':'20120001',
       'name':'Bob',
       'age':21}
table = 'students'
keys = ','.join(data.keys())
values = ','.join(['%s']*len(data))
sql = 'insert into {table}({keys}) values({values}) on duplicate key update'.format(table=table,keys=keys,values=values)
update = ','.join(['{key}=%s'.format(key=key) for key in data])
sql += update
db = pymysql.connect(host='localhost',user='root',password='Lxk815714',port=3306,db='spiders')
cursor = db.cursor()
try:
    if cursor.execute(sql,tuple(data.values())*2):
        print('succeed')
        db.commit()
except:
    print('failed')
    db.rollback()
db.close()

failed

In [37]:
# 打开数据库连接
db = pymysql.connect(host='localhost',user='root',password='Lxk815714',port=3306,db='spiders')
 
# 使用cursor()方法获取操作游标 
cursor = db.cursor()
 
# SQL 删除语句
sql = 'delete from students where age>=25'
try:
   # 执行SQL语句
   cursor.execute(sql)
   # 提交修改
   db.commit()
except:
   # 发生错误时回滚
   db.rollback()

# 关闭连接
db.close()

In [40]:
pgdb = pymysql.connect(host='localhost',user='root',password='Lxk815714',port=3306,db='pgdb')
cursor = pgdb.cursor()
sql = 'select * from fruits'
try:
    cursor.execute(sql)
    result = cursor.fetchall()
except:
    print('failed')
    pgdb.rollback()

print(result)

(('a1', 101, 'apple', Decimal('5.20')), ('a2', 103, 'apricot', Decimal('25.20')), ('b1', 101, 'blackberry', Decimal('10.20')), ('b2', 104, 'berry', Decimal('7.60')), ('b5', 107, 'xxxx', Decimal('3.60')), ('bs1', 102, 'orange', Decimal('11.20')), ('bs2', 105, 'melon', Decimal('8.20')), ('c0', 101, 'cherry', Decimal('3.20')), ('l2', 104, 'lemon', Decimal('6.40')), ('m1', 106, 'mango', Decimal('15.60')), ('m2', 105, 'xbabay', Decimal('2.60')), ('o2', 103, 'coconut', Decimal('9.20')), ('t1', 102, 'banana', Decimal('10.30')), ('t2', 102, 'grape', Decimal('5.30')), ('t4', 107, 'xbababa', Decimal('3.60')))

In [43]:
import pandas as pd
import numpy as np
pd.DataFrame(list(result))

      0    1           2      3
0    a1  101       apple   5.20
1    a2  103     apricot  25.20
2    b1  101  blackberry  10.20
3    b2  104       berry   7.60
4    b5  107        xxxx   3.60
5   bs1  102      orange  11.20
6   bs2  105       melon   8.20
7    c0  101      cherry   3.20
8    l2  104       lemon   6.40
9    m1  106       mango  15.60
10   m2  105      xbabay   2.60
11   o2  103     coconut   9.20
12   t1  102      banana  10.30
13   t2  102       grape   5.30
14   t4  107     xbababa   3.60

In [47]:
sql = """ select f_id,s_id,f_name,
case 
    when f_price>10 then '贵'
    when f_price<5 then '便宜'
    else '中'
end as '价格水平'
from fruits"""
try:
    cursor.execute(sql)
    results = cursor.fetchall()
except:
    print('failed')
    pgdb.rollback()
print(results)
# 获取字段名
# select COLUMN_NAME from information_schema.COLUMNS where table_name = 'your_table_name';

(('a1', 101, 'apple', '中'), ('a2', 103, 'apricot', '贵'), ('b1', 101, 'blackberry', '贵'), ('b2', 104, 'berry', '中'), ('b5', 107, 'xxxx', '便宜'), ('bs1', 102, 'orange', '贵'), ('bs2', 105, 'melon', '中'), ('c0', 101, 'cherry', '便宜'), ('l2', 104, 'lemon', '中'), ('m1', 106, 'mango', '贵'), ('m2', 105, 'xbabay', '便宜'), ('o2', 103, 'coconut', '中'), ('t1', 102, 'banana', '贵'), ('t2', 102, 'grape', '中'), ('t4', 107, 'xbababa', '便宜'))

In [48]:
sql = """select s_id,s_name,ifnull(s_city,'地址未知') from suppliers"""
try:
    cursor.execute(sql)
    result = cursor.fetchall()
except:
    print('failed')
    pgdb.rollback()
print(result)

((101, '供应商01', '北京市'), (102, '供应商02', '北京市'), (103, '供应商03', '上海市'), (104, '供应商04', '北京市'), (105, '供应商05', '广州市'), (106, '供应商06', '保定市'), (107, '供应商07', '北京市'), (108, '供应商08', '石家庄市'), (109, '供应商09', '北京市'), (110, '供应商10', '地址未知'))

In [49]:
pgdb.close()

In [50]:
# 创建表
sql = '''create table goodscolor(
color_id varchar(6) primary key default '-',
color_note varchar(20) not null default '-')'''
db = pymysql.connect(host='localhost',user='root',password='Lxk815714',port=3306,db='test')
cursor = db.cursor()
cursor.execute(sql)

0

In [ ]:
#加载数据
sql = """load data local infile '/Users/brianlee/Desktop/MySQLdata/data/GoodsColor.txt'
into table goodscolor
fields terminated by '\t'
ignore 1 lines"""
cursor.execute(sql)

In [53]:
db.close()

In [54]:
db = pymysql.connect(host='localhost',user='root',password='Lxk815714',port=3306,db='pgdb')
cursor = db.cursor()
sql = 'select f_id,f_name,f_price,s.s_id,s_name,s_city from fruits as f join suppliers as s on f.s_id=s.s_id'
cursor.execute(sql)
result = cursor.fetchall()
print(result)

(('a1', 'apple', Decimal('5.20'), 101, '供应商01', '北京市'), ('a2', 'apricot', Decimal('25.20'), 103, '供应商03', '上海市'), ('b1', 'blackberry', Decimal('10.20'), 101, '供应商01', '北京市'), ('b2', 'berry', Decimal('7.60'), 104, '供应商04', '北京市'), ('b5', 'xxxx', Decimal('3.60'), 107, '供应商07', '北京市'), ('bs1', 'orange', Decimal('11.20'), 102, '供应商02', '北京市'), ('bs2', 'melon', Decimal('8.20'), 105, '供应商05', '广州市'), ('c0', 'cherry', Decimal('3.20'), 101, '供应商01', '北京市'), ('l2', 'lemon', Decimal('6.40'), 104, '供应商04', '北京市'), ('m1', 'mango', Decimal('15.60'), 106, '供应商06', '保定市'), ('m2', 'xbabay', Decimal('2.60'), 105, '供应商05', '广州市'), ('o2', 'coconut', Decimal('9.20'), 103, '供应商03', '上海市'), ('t1', 'banana', Decimal('10.30'), 102, '供应商02', '北京市'), ('t2', 'grape', Decimal('5.30'), 102, '供应商02', '北京市'), ('t4', 'xbababa', Decimal('3.60'), 107, '供应商07', '北京市'))

In [55]:
sql = """select f_id,f_name,f_price,s.s_id,s_name,s_city 
from fruits as f right join suppliers as s 
on f.s_id=s.s_id 
where f_name='melon'"""
cursor.execute(sql)
result = cursor.fetchall()
print(result)

(('bs2', 'melon', Decimal('8.20'), 105, '供应商05', '广州市'),)

In [56]:
sql = 'select * from fruits where f_price > (select avg(f_price) from fruits)'
cursor.execute(sql)
result = cursor.fetchall()
print(result)

(('a2', 103, 'apricot', Decimal('25.20')), ('b1', 101, 'blackberry', Decimal('10.20')), ('bs1', 102, 'orange', Decimal('11.20')), ('m1', 106, 'mango', Decimal('15.60')), ('o2', 103, 'coconut', Decimal('9.20')), ('t1', 102, 'banana', Decimal('10.30')))

In [58]:
sql = 'select * from fruits where s_id in (select s_id from suppliers where s_city = "北京市")'
cursor.execute(sql)
result = cursor.fetchall()
print(result)

(('a1', 101, 'apple', Decimal('5.20')), ('b1', 101, 'blackberry', Decimal('10.20')), ('b2', 104, 'berry', Decimal('7.60')), ('b5', 107, 'xxxx', Decimal('3.60')), ('bs1', 102, 'orange', Decimal('11.20')), ('c0', 101, 'cherry', Decimal('3.20')), ('l2', 104, 'lemon', Decimal('6.40')), ('t1', 102, 'banana', Decimal('10.30')), ('t2', 102, 'grape', Decimal('5.30')), ('t4', 107, 'xbababa', Decimal('3.60')))

In [59]:
sql = 'select * from fruits where f_price > any(select f_price from fruits where f_price>10)'
cursor.execute(sql)
result = cursor.fetchall()
print(result)

(('a2', 103, 'apricot', Decimal('25.20')), ('bs1', 102, 'orange', Decimal('11.20')), ('m1', 106, 'mango', Decimal('15.60')), ('t1', 102, 'banana', Decimal('10.30')))

In [60]:
sql = 'select f_name,f_price from fruits union select s_city,s_id from suppliers'
cursor.execute(sql)
result = cursor.fetchall()
print(result)

(('apple', Decimal('5.20')), ('apricot', Decimal('25.20')), ('blackberry', Decimal('10.20')), ('berry', Decimal('7.60')), ('xxxx', Decimal('3.60')), ('orange', Decimal('11.20')), ('melon', Decimal('8.20')), ('cherry', Decimal('3.20')), ('lemon', Decimal('6.40')), ('mango', Decimal('15.60')), ('xbabay', Decimal('2.60')), ('coconut', Decimal('9.20')), ('banana', Decimal('10.30')), ('grape', Decimal('5.30')), ('xbababa', Decimal('3.60')), ('北京市', Decimal('101.00')), ('北京市', Decimal('102.00')), ('上海市', Decimal('103.00')), ('北京市', Decimal('104.00')), ('广州市', Decimal('105.00')), ('保定市', Decimal('106.00')), ('北京市', Decimal('107.00')), ('石家庄市', Decimal('108.00')), ('北京市', Decimal('109.00')), (None, Decimal('110.00')))

In [61]:
sql = 'select * from fruits where exists (select f_price from fruits where f_price>25)'
cursor.execute(sql)
result = cursor.fetchall()
print(result)

(('a1', 101, 'apple', Decimal('5.20')), ('a2', 103, 'apricot', Decimal('25.20')), ('b1', 101, 'blackberry', Decimal('10.20')), ('b2', 104, 'berry', Decimal('7.60')), ('b5', 107, 'xxxx', Decimal('3.60')), ('bs1', 102, 'orange', Decimal('11.20')), ('bs2', 105, 'melon', Decimal('8.20')), ('c0', 101, 'cherry', Decimal('3.20')), ('l2', 104, 'lemon', Decimal('6.40')), ('m1', 106, 'mango', Decimal('15.60')), ('m2', 105, 'xbabay', Decimal('2.60')), ('o2', 103, 'coconut', Decimal('9.20')), ('t1', 102, 'banana', Decimal('10.30')), ('t2', 102, 'grape', Decimal('5.30')), ('t4', 107, 'xbababa', Decimal('3.60')))